<?php
// +----------------------------------------------------------------------
// | Get Everybody Coding [ CODE CHANGES THE WORLD ]
// +----------------------------------------------------------------------
// | Author: Jean
// +----------------------------------------------------------------------
// | Time: 2019-04-28 23:19:32
// +----------------------------------------------------------------------
//冒泡排序
function bubble_sort(array $arr) :array
{
    $len = count($arr);
    if ($len <= 1) {
        return $arr;
    }
    for ($i = 1; $i < $len; $i ++) {
        for ($j = 0; $j < $len - $i; $j++) {
            if ($arr[$j] > $arr[$j + 1]) {
                $tmp = $arr[$j];
                $arr[$j] = $arr[$j + 1];
                $arr[$j + 1] = $tmp;
            }
        }
    }
    return $arr;
}
$arr = [10, 3, 2, 5, 9, 1, 8, 7];
print_r(bubble_sort($arr));
