<?php
// +----------------------------------------------------------------------
// | Get Everybody Coding [ CODE CHANGES THE WORLD ]
// +----------------------------------------------------------------------
// | Author: Jean
// +----------------------------------------------------------------------
// | Time: 2019-04-29 13:52:08
// +----------------------------------------------------------------------
//猴子选大王-约瑟夫环问题
//一堆猴子都有编号，编号是1，2，3 ...m，这群猴子（m个）按照1-m的顺序围坐一圈，从第1开始数，每数到第N个，该猴子就要离开此圈，这样依次下来，直到圈中只剩下最后一只猴子，则该猴子为大王。
function monkey_king(int $m, int $n) :int
{
    $arr = range(1, $m);
    $i = 1;
    while (count($arr) > 1) {
        $pop = array_shift($arr);
        if ($i % $n != 0) {
            array_push($arr, $pop);
        }
        $i ++;
    }
    return $arr[0];
}
print_r(monkey_king(10, 3));
