<?php
// +----------------------------------------------------------------------
// | Get Everybody Coding [ CODE CHANGES THE WORLD ]
// +----------------------------------------------------------------------
// | Author: Jean
// +----------------------------------------------------------------------
// | Time: 2019-04-29 14:46:00
// +----------------------------------------------------------------------
//求n以内的所有质数
function prime(int $n) : array
{
    if ($n <= 1) {
        return [];
    }
    if ($n == 2) {
        return [2];
    }
    $prime = [2];
    for ($i = 3; $i < $n; $i += 2) {
        $sqrt = intval(sqrt($i));
        for ($j = 3; $j <= $sqrt; $j += 2) {
            if ($i % $j == 0) {
                break;
            }
        }
        if ($j > $sqrt) {
            array_push($prime, $i);
        }
    }
    return $prime;
}
print_r(prime(100));
