<?php
// +----------------------------------------------------------------------
// | Get Everybody Coding [ CODE CHANGES THE WORLD ]
// +----------------------------------------------------------------------
// | Author: Jean
// +----------------------------------------------------------------------
// | Time: 2019-04-28 23:25:13
// +----------------------------------------------------------------------
//选择排序
function select_sort(array $arr) :array
{
    $len = count($arr);
    if ($len <= 1) {
        return $arr;
    }
    for ($i = 0; $i < $len; $i ++) {
        $p = $i;
        for ($j = $i + 1; $j < $len; $j ++) {
            if ($arr[$p] > $arr[$j]) {
                $p = $j;
            }
        }
        if ($p != $i) {
            $tmp = $arr[$p];
            $arr[$p] = $arr[$i];
            $arr[$i] = $tmp;
        }
    }
    return $arr;
}
$arr = [10, 3, 2, 5, 9, 1, 8, 7];
print_r(select_sort($arr));